<!-- <div class="convert-wrapper"style="width: <?= $target['len'] * 10 ?>px;"> -->
<div class="convert-wrapper">
    <!-- <table style="width: <?= $target['len'] * 10 ?>px;"> -->
    <table>

        <?php if(!isset($target)):?>
            <?php
                $str = 'ｇんよバ亡プ乍心上グたけづ心ｇ人パＥ丁フヒジＲア千バぉど心立比応応呂法長出且正止ちぁｇ心づ亡よん干ぉゴ汀で千づ千Ｎ干ｇブ亡ケ干乍 づ汀テぉんんグ乍勺仁勺八ぉ千了寸じメｗてＥ丁ア了ｇぁ虫汲焔遍襖鱈晴鱈整瞥酬整識嫉畝技左以山ぁゅ三心仁パＧ千寸ｗバｇ了下コ了ゎブ千 づ汀勺汀よ仁乍プで汀汀パＧ汀》ペ寸つ了ゎてｗ心凸拡遊襖緬綱屡凝繊爆漉屡燈敷歳謂電撃際勲舶枕込止ヴ仁ら上ｇマツペジ千ペ人じ人下づケ 【ペ千ゴ千千汀パでゅテぉ人Ｒ》『》バｇｇぉ比成農勝噸膨師渥裏鑓織織櫨魔蟻裏凝絶橿鱈餌黙紬整撫柚辿九仁キ亡にＥフコＥｗ丁てに了フぉ 人》丁千寸】了了上干ｇ丁了と》ぇ《上七之云戯鐘鰯雛陸寧頂橿編曙欄禰鱒磯饗讐機櫨鰯廠脆遡銅矯鋤遷猶叙比止小じ上づナ人《人ク上ぉヤ乍 コじょ【寸い【ｗ了下【ペ《うペｗてブ点項握織蟹轄篇院卵禎構撃濠曙麟欄鰯禰禰讃禰繭藁櫨願遊選飼撒遵墾魅志止ｇペフヒ』フ丁【下下でプ 寸ペ》ｇ丁』【ペォフ》』Ｃン【ｇ上之鴻緩鯖騎賑遍適軌呪哩漉構犠犠隅傭轍蟻趨櫨綴禰鱒讐磯機隆飯遁漉傭鰯腫貞んＫ【寸》し』《【】コｇ 寸バ》丁ヘ》ナ》【い』ェしＦ【パ占項咽葡慎第俺屠飼粁雫瑚範禁柵漉蕪幡鑓讃醜趨鍍禰讃穐馨膿磯鯵隆遷犠魔鱒腫枕んパユ】《ョｄ《フ』【 了】》ぺｐョ】『べ》『ぺ』ｑ寸土曲艇避鮫適紡理嘩飢私曳涯魁鳳遍濃鮪墨曙畷鄭鰭墾傭鷲讃讐謄穐磯藁躍曙讃鯵擾優柱汀【ペメ丁二ＦＰｗＣ ｇ了ベ十《ベド』》丁『へし《寸没遷蒙遁動屠断漬罪炉甲坤覗剛賦橋堕襖繋傭艶贋髪犠傭魔璽擾櫨擾藁膿纂躍露麟禰鰯離妃心】ＰイＦ『ｙ丁Ｆ 千】べ』『ュ』二『？『［『『は蓮震甑鋼骸蹄湾雫門平デ不汚丙帯寧珊簡糟醜鰭麟擁塞裏欄穐鰯禰禰讐饗讐擾謄艶傭磯鰯裏払ｇヵ？ェ『べ【》 寸丁』シ』《》ヘ『〕ェァＰゴ浅網咽蘇師狩可穴下丁《丁『下汀デ刀戸河丙悶憾犠鄭轍優簸騰禰禰鱒穐騰鰯鱒穐躍傭磯鰯饗鋤ぁ》ュ十《』丁こ フ》《Ｆ『『Ｐ？Ｔ］Ｙ［し宝楕藩野牢汗下Ｆ？ＴＴ「〔ノ［『了千ぁデ不吊束掃関蘇繁灘幡傭鰯禰磯鰯擾鰯讃穐藁磯饗磯擾船人【丁し『》Ｙ 》十》しＹＰｕ〕〔［ｕ『ぁ揃樋牽灯午ｇョ』？「一一「ｆ「ＴＰベ千サげ守ぼ項剣珊狸慣犠蟻讃讃穐鱒穐鰯穐櫨磯磯鱒鱒磯露劣ょ二イくＦｙ 『Ｙ『Ｆ］］］〕［Ｙべ人活遡翠狂古チ千Ｔ１１「 ；。「一「「「〔『【デポ苅迎梢浦屠燦曙露醜禰磯鰯竃鱒鰯綴禰鰯鰯讃禰腹止』『ァ〔』 『ヘ』く］」｝〈［〔ォゼ痢遼隙咋下く〉，「。「「「。「「「〈〈一ＴＹ下ぷ円消則惇漬橿編曙縄魔膿馨鱒機鰯醜議鰯磯鰯醜櫨秒ｇＰへｙし 『べ二へｈ？（ィｎ『ぁ迎戯艇形た』〉「。；一。「。一「。ｒ「〈〈〈『ペ干ギぱ青須創稲醗幡曙轍禰膿馨藁鰯傭鰯魔磯鰯魔穐膨仁』〔］［ 《『］［Ｔ〉ＴＴへ《点鋪櫨飯計三Ｆ」「。「一。。「。一。「「「〉〈〔『ヅろ刈羽鴻漸適梱襖轡轍讃穐鱒馨饗櫨磯櫨欄磯鰯擾優弘』〕Ｌ［ Ｆ『］Ｔ（〉「〈〔勺鳩趨謄院升仁ｙ〉「一一。ｒ「。。「 「「一〈「〉［【ヲぴ弔涜増潔報漉握鄭鷲麟禰穐膿嚢擾藁鰯讐謄禰鰯駁上へェ［ ［くァ〈〕）〈〜ヘ当佃鰯艶肥朴汀し。「。；。。；。。。「。「。〈〈っェ上ヱぜ甲明問桐甥蔵壌墾讃編灘傭饗禰鱒磯繍饗擾藁磯鷹之』？［ 《Ｆｈ「。〉〜〔ゅ冗渓鷲萎妨丈に二）。。。。〈。。。一。「「一〈〈へ人ぉセ守卒消迎南浦関樋鯖響犠鍾擾穣磯繍膿翻饗鱒纂膿腫赴じェ《 『ュ』「〉」〈【忙払滅鰯艇症什ナ』〉「。。〉ｊ一一。。〈一一。〈［ょｇらゲヂ甘仔何項袴幣橋叡農議鰯擾饗穐磯繍欝饗嚢纂藁鰯鋭パ上よ 『］？｛〉〈ュポ北逝遭綴脇料久】［」〈１。 １「。〉一「；。「」［丁了づ勺も予ぴ字窄宰湾袴遜幡魔讃鱒饗鷲磯饗鱒磯翻磯翻饗艶み朴げ 『（｝「「〈ゅ乞貞樺漉魔箭卒朴】］｛〉「」「一。一一。〈「一〈｝［べ】千千ゲチ不今仔苧窄荒那遷傭讃轍穐鱒繍磯磯磯翻欝翻磯擾釣孔尖 Ｔ〉｝。｛［主刈損駒濠擾畝升乙》こ」」」〉。。。。「〈。１。｛〈（ノ十《【了づ勺デぞボ汚甫嶋憾犠響灘墾魔藁馨鱒竃馨翻嚢鱒磯終吋忙 「〈「〉」《忙消庭鞄遵謄粋牛アゃＦｎ一」」〈。。「一「「。〈｛「〈｝ＹＦ『ｇ上汀ヅデ乃め弔望遡徽糠織機擾磯纂擾膿讐鱒翻饗膿象計永 ｛一〉〈〈ぉ刈造剰銅儀擾酎吐ｍＦｖ一。）｛〈。。。。。「一「〈」〔〔Ｌ］ｙ【下ｇゅぁ占州党湘渥握鰯嚢饗欝禰磯鰯穐磯磯纂鱒鱒範洋其 ｛。。〈〔ぷ尖覗脆劃禰擾粋引ｇ［」」ｖ」」。；。。。１。ｊ［ょｇ七ョ人ｍ』【斗セ止占允ぼ項滅漉傭欄鱒磯磯竃磯翻櫨膿磯磯襲嚢髪吃具 「；。「〔ぎ泳凋鰐歓墾擾酌む下》ェェョょｙ」｛。。１〈〈人山主な之止土よぉぉ火之比当出凶頃域襖魔藁馨磯繍翻鷺翻鰻鱒饗磯翻鱒鷹乱海 。〈。」つ杓地渚懐傭欄謄鮒朴ぉ上ぉ止占比以』」｛｛。［ゴ出迩会迩良仙走出仙込戊ぬ拍皆送紗増痴幾禰鱒讐膿磯襲磯翻鰯鷲磯膿饗磯讐烈涌 〈一ｖュヱ拍雨剥漕轡随擾翫由広兆迫染肺枝秋弘ょ｛〔っ上当温装嵐挿姉丙窄峡俸姐鉱後減遂映過退魂漉蟻讐饗磯鱒纂鷺翻饗纂磯磯纂魔纂紗裡 一〈［《ズ秋渦遮欽憶漉擾脆駈舶牌灯デ口江弐牲引（Ｔヘヨ追遇渥鼎忙汀ぁぁ企羽摘犠編嘱艇鉾映閉鼎槽畷鰯禰禰磯磯磯嚢繍馨鷺馨讐磯纏彰塀 」［『バゼ悩温新統柵腕擾脇慣蹟起禎詠屡駿絞釘乱し「『内昏簿弊私当洲噸櫨櫨輸絵遁糧墨陵評窄宰岬遇遷墾擁鄭墾磯膿翻翻膿磯纂馨鰯讐勤測 〈［ｗ上ぶ淳漆賎錠漉遵穐婦壱環噂訂予墨讃陰粗今』〈『ぼ釈育牢弁了く珂犠綱際獅噂薪耐号不予ぼ鴻週棚欄櫨萎傭鱒磯翻竃讐磯翻膿饗鷲腹溺 『斗》づ刀母瀕網解凝綴擾駄げ汚乎》《戸仔汚汗ヲＦ「ソ切南帯孔】」［『冗冗巴冗芹不汀】下げ卒明瀬構欄鰯露魔穐膿竃膿翻櫨膿鱒饗磯獣瑚 まぷ》ゴ川測鵠慮励壌鰯讐形少不たｇｇぁ虫井Ｗ汀］。［当斧烈礼ぉｇォ上ｇ止主応升午Ｅ』寸げ化追堀輔傭藁鰯擾鱒磯鱒磯欝鷺鷲磯翻磯艇頑 恥淡仁止辿閃嘆豊蛸響擾讐叱了丁ベ下午吊辛乍ＦＦ］。っポ杵叩叶了了でＷ中今守午てベＦュ上ヨ当凋桟遵禰磯竃磯竃讐藁膿讐磯鰯禰饗磯萎遇 他遇札当粁済蕩叡裂灘擾讐め』〈〉」）ＴＴＴ〈ェ〔〉『予円今ア？Ｔ「〉「「「「「〔『人ぉ占出渓梱曙魔竃嚢翻磯翻竃翻纂磯磯櫨讃饗鰯賦 湖遊約淳侍為通握絶鑓讐讐牝』［」〈」「。「〈Ｔ「」《ヴザ午Ｅ］。〈一。「「〉〈［《ｇヨ允羽湖遁傭竃欝磯嚢鷺磯膿翻翻磯鱒鰯鰯磯馨贈 潰謹誌易蕊評潔壕隅禰欝讐粁心ょュ〉｛〈「〈［ぃ「〈《ふダたＥ〕〉〈。。ｉ」〈〈『人ぁゼ句油潔遷蟻磯翻馨膿磯鱒讐磯翻磯饗鰯讃磯纂酷 逢屠軌影道紗魂濃範犠穐讐廷ゅ二Ｙ〉「。〈〈？Ｔ．〈【止牛ヲｇ〕」」〈〉〈｝」〈ｐぉ立尖羽須魂遵機磯鱒磯繍讐鰯纂欄翻磯纂鰯磯櫨馨膨 賞熊痴錠簿監渥蕪瞥播傭磯鮒た』〉「〈ｖ〈ｎ〕ｊ，〈『ろ占久ぉ］〕」「」〈」｝ってぁ尖ぬ汲漸柵犠櫨馨穐磯饗繭繍纂櫨藁嚢纏饗磯鰯讐経 慣瀕濃飽遅婆雌膚郷電灘讐胸生』」」〈」「（ュ〕。〈【ぁ占占仁しＬｕ」〉〈ｕ［《心ゼば完恒漠遭鑓磯竃磯讐鱒磯欝磯鱒磯讐讐鰯禰謄讃脇 整濠播陰蛾輸壕蓬絶橿露穐陰訂に］Ｔ）｛〈っ》〉〈「《ゼ凸叫之ＦｋＴ］」ｕェ『ｇ止注坦柱逃魂濃傭鱒磯鱒讐磯繍饗膿磯翻磯翻竃藁擾議編 遵墜議線鑓憂憾薯隈儀魔櫨隠机止』］〈」〔《ょ〕〈〔づぷ引ゼ孔］［〔｝〜［《上ヴぜ瓦法淫湘遍遷欄穐櫨鱒鰯讃讐讐磯磯磯膿竃磯欝鱒綴鰯 愛轡覆裏傭露謙腹瀧壌鰯磯鰯妨払にェぃ［ュペぉ。〈ェ占此仙走血』「｛Ｔｕしコぉぷ尖珂送這潔憾戴農禰繭鰯擾磯繍纂磯磯嚢磯纏鱒欝鰯魔磯 犠懸薩鰯曙禰曙露諭儀鰯櫨讐断泌止ｇ】ェＦ［令ん人ほ遮慮魁後盈Ｅ〕「〔ェ【ぉ九ポぼ由須湘屋渥轡鑓禰禰櫨磯膿翻翻膿膿翻磯欝磯竃讐擾護 壕樋醒麟曜濠遵穐艶震鷲禰膿勧亥生ぁんｗ］〉「与曳途膚鰭艶緬凱にＬ〔『上心ヨ凸ば此明頂翌唖棚謙犠禰鱒磯膿鱒翻磯繍纏翻膿鱒鱒鱒繭膿繭 凝鯉濠薮濠櫨鰍欄躍儀魔鰯禰獣軒幻仏山心］」」「字屠繊購瞥産牟仁《上ぉ工ぁぶ主虫近吻到悉漕遭徽犠魔鰯擾鷺擾磯膿竃翻翻馨鱒磯鰯讃穐萎 網鮪樋醐蟻鯵鑓蟻艶傭鰯禰饗響詐外叱をた】］｛〉ペ洞南答苓苧朴占山仏点山牛Ｍポぱ弔甫帯掃蛸環壌傭醜櫨磯鱒讐磯纏翻讐欝鱒櫨櫨鱒磯鱒墾 繊雌橋働轍魔欄畿難鐸曙穐鰯藁駐汰戸不山山心〔」『ゲ可狂迂込ね応此針吋牛ぶザ正汚児宜塙這速遁壕曙擾磯膿饗磯嚢嚢翻欝翻藁擾馨磯膿鰯艶 線働紬遷穫曙傭謄甑動餌傭鰯穐脆弁乎げヂぱ為私兆止止治会訟造畠塗紳牝不チ刀穴ポ卒治貞昌退魂濃嘱魔禰磯繍繭磯翻欝磯翻磯纏纏欝饗穐鯵優 鯉藩齢糟輝編傭雛叡構塞讃穐磯隆杭朴たプデデ了ゲザ叫邦哨郭閑博肥冗ろデ干勺ぁ点尖羽恰問視噴凝鑓鰭禰磯鱒讐鷺鰯磯膿翻磯竃翻讐繍繭鰯繭 檀稽構嘗暢嘱覇観碗壕櫨織擾磯鰯脈札止仁》〕〈ｕＬュ『ラ王弐釘孔山ヂ午ゅヨ占刈出党盗湖遣換樋覆傭櫨擾磯藁鱒饗磯繭膿讐翻繍磯鱒穐鰯躍 憶第黙撃鴫郷犠緬錠麺璽傭穐擾膿薮析比たｇｙっコＱ尖志合迫赴厄ゐ凸孔之山占主応血鴻道損遊渥襖薗傭櫨禰鱒讐鰯餐鱒鰯餐膿翻纂磯纂磯讐魔 遅鯨遇叡嘘鋤廠猶齢墨穐躍欄饗饗穐諏杖必止と《《げ判雫垣司杵叩門勾寺企代允迂呂浪混焔遇屠濃襖麹禰纂磯饗騰穐嚢擾磯嚢翻磯竃纏饗磯纂繭 蒲暗博範遷銅幡畷艶蟻禰躍傭禰繍擾鰯歳秋辻ゅ【ＦＹ『了で午平守吊ば河弁吋ぼ拘海液戚遥蝕遡樫樋鑓欄禰鷲擾藁磯膿膿馨纂磯翻翻讐翻繍讐露 辱鉱副橋睡噛障幡顧禰鰯穐畿趨禰鱒磯鰯叡乳山メ〉〉。「〈『ゴゼ巧必ゐ且虫怠送退預遇遅亀憾鮪壌傭櫨禰鰯璽鰯禰磯嚢欝馨膿讐磯翻鱒讐鱒鯵 帯茂剥富鳴藍懐濠顧艶傭震轍曙鄭禰磯繍纂輸由ぁ］。。。〈［ヴゼ弓企ば史怠吸減裳進粟嗣慣楯屡儀魔櫨鰯禰騰穐鱒膿翻馨膿翻磯磯翻馨膿鰯織 進転起潮鮎域齢幾贋懇愛瞬働難瞭擾膿翻繭纂齢告ｇぃｊ」［上火占必此怠起哉掬嘘遁脆菌嘆遁灘艶魔繍鰯鷲擾機鱒磯馨鱒讐磯翻膿讐翻讐鱒鰯鯵 慣確峰悔絵噸載劉種樋輸藩鹸軽漉禰磯翻磯翻纂脇ぬよょｗ心Ｑ占必拍垢戚掘蝕嘘瀦範関罷魅蓬塞傭魔鰯鰯穐穐藁穐鱒聾櫨欝鱒纂磯馨翻欝繭鰯織 寧鴻述溺歓噸薮瞥槽犠臓萎篭隆傭穐膿翻嚢嚢纏纂娼紅弘比ゐ出皮砧哉逓遁銃遁隈瞥亀脳廠萎魔傭鯵欄禰鰯禰騰禰馨欄藁磯纂磯磯磯讐鱒欝鰯饗櫨 号巨洞岡環誕蓬頗朝曙躍艶魔議鰯磯璽磯磯馨磯翻纏塞遠退娃痴進嘘錠脳遭歳葡戯量蓬犠櫨魔趨鄭隠播麺禰鱒糠鰯鷲魔鰯讃鰯擾磯磯磯磯翻繍繍鰯 祉如枯項個編蓬緬絶幡魔醜鰯禰魔禰磯翻欝翻翻翻馨磯鰯廠廠廠蹴量幌雌腕繊編裏魔磯鯵醜薩畷隠播購幡穣簾讃魔鰯騰擾鰯磯饗嚢膿磯磯翻鱒饗鰯 近私匹売濡劉職曙鞠傭穐躍艶遵禰鰯禰繍翻膿翻馨翻纏翻翻醜織傭織織鰯議櫨鰯磯鱒欄謄髪鰹難懇壕膝鎌隠鰹隠傭穐魔繍鰯擾磯馨磯嚢繍繭繭鱒機 苫針苫追剥範渥嫌鱗織傭鰯勝擁櫨欄機磯馨鱒翻磯繍馨翻讐薪慣轡曙曙醜穣聾謄禰鰯曙艶勝騎遷艇遷瞬聯脳橋肇幡禰鰯讃磯膿膿翻磯翻饗馨讃讐鱒 没列雫亭淵遁矯鐘艶傭穐謄擬禰躍禰穐膿讐馨鱒膿欝膿翻鰯訊岡閉罰奪稽轡響響鰹蟹鐸瞬軽慣奪剛箸降限胴顎懇蹟櫨禰繍磯磯磯馨膿馨嚢謄鄭魔藁 奇丙凪渓這浦鱈萎艶讃畷艶曙傭鯵傭磯磯欝鱒磯磯馨磯翻腫軒甲司回莞濡嘆槽篭濠網蕪猷狸窮漕酔奉浸照漢墳環糧曙綴離禰磯鱒鱒磯欝讐鯵鱗傭禰 苛坪苅苓浬墳閲鰯編優陵睡壌議懇魔磯磯鱒馨膿繍翻磯欝擾記び字苅狩芭菅習関稽柵聯鴨鯨誓罪匝雨軒岡翌鼎場樋握傭露醜璽磯纂磯翻繍鰯臓醜畿';
                $split = preg_replace("/( |　)/", "", $str);
                $list = preg_split("//u", $split, -1, PREG_SPLIT_NO_EMPTY);
                $target['len'] = 64;
                $row = $target['len'];
                $col = count($list) / $row;
            ?>
            <?php for($i = 0; $i < $col; $i++):?>
                <tr>
                    <?php for($j = 0; $j < $row; $j++):?>
                        <?php if(isset($list[($row * $i) + $j])):?>
                            <td class="unit-char"><?= $list[($row * $i) + $j]?></td>
                        <?php else:?>
                            <td class="unit-char"></td>
                        <?php endif;?>
                    <?php endfor;?>
                </tr>
            <?php endfor;?>
        <?php endif;?>

    </table>
</div>